{
  "quotes": [
    "“Winners never quit, and quitters never win.” —Vince Lombardi",
    "consists of what you do on the third and fourth tries.",
    "“Hope is a good thing, maybe the best of things, and no good thing ever dies.” —Andy Dufresne, Shawshank Redemption",
    "Dealing With Burnout? Here are 30 of the Most Inspiring Quotes to Keep You Motivated",
    "me, or nobody is gonna hit as hard as life. But it ain’t about how hard ya hit. It’s about how hard you can get hit and keep moving forward.",
    "“Just because you fail once doesn’t mean you’re gonna fail at everything.” —Marilyn Monroe",
    "secret of our success is that we never, never give up.",
    "just never give up. You do a task to the best of your abilities and beyond.",
    "“The man who moves a mountain begins by carrying away small stones.” —Confucius",
    "give up on what you really want to do. The person with big dreams is more powerful than the one with all the facts.",
    "little more persistence, a little more effort, and what seemed hopeless failure may turn to glorious success.",
    "\"We all can dance when we find music that we love.\" —Giles Andreae",
    "“There should be no boundaries to human endeavor. We are all different. However bad life may seem, there is always something you can do, and succeed at. While there’s life, there is hope.” —Stephen Hawking, The Theory of Everything",
    "quit believing that you can develop in life. Never give up. Don’t deny the inward spirit that provides the drive to accomplish great things in life.",
    "don’t defeat you — you defeat yourself when you give up.",
    "one of the triumphs of life is choosing not to give up! Facing our challenges with determination and perseverance until we conquer them, and sometimes ourselves in the process.",
    "“Success is no accident. It is hard work, perseverance, learning, studying, sacrifice and most of all, love of what you are doing or learning to do.” —Pele",
    "up is always tempting in challenging situations, but these never give up quotes will strengthen your resolve to stick with it.",
    "\"Happiness and influence and that which you seek to make your life complete.\" —Louis Howard",
    "can’t quit or give up before you get it!",
    "\"If opportunity doesn't knock, build a door.\" —Milton Berle",
    "never quit, and quitters never win.",
    "actually learned that you should never give up, and if you love something, take courage and absolutely go after it.",
    "out how to stay motivated in the face of failure or after a particularly demoralizing setback can feel nearly impossible. Your spirits are low, you feel defeated and you're starting to wonder why you even bothered in the first place.",
    "\"Never bend your head. Always hold it high. Look the world straight in the eye.\" —Helen Keller",
    "“In every job that must be done, there is an element of fun. You find the fun and—snap!—the job’s a game!” –Mary Poppins",
    "\"Life is like riding a bicycle. To keep your balance, you must keep moving.\" —Albert Einstein",
    "“Remember to look up at the stars and not down at your feet. Try to make sense of what you see and wonder about what makes the Universe exist. Be curious. And however difficult life may seem, there is always something you can do and succeed at. It matters that you don't just give up.\" —Stephen Hawking",
    "\"Your victory is right around the corner. Never give up.– Nicki Minaj",
    "\"Perfection is not attainable, but if we chase perfection we can catch excellence.\" —Vince Lombardi",
    "you get into a tight place and everything goes against you, till it seems as though you could not hang on a minute longer, never give up then, for that is just the place and time that the tide will turn.",
    "“Just because someone stumbles and loses their path, doesn’t mean they’re lost forever.” –Professor X",
    "confidence, and persistence are key in life, so never give up on yourself.",
    "of life’s failures are people who did not realize how close they were to success when they gave up.",
    "“Don’t be discouraged. It’s often the last key in the bunch that opens the lock.” –Unknown",
    "“It’s not that I’m so smart, it’s just that I stay with problems longer.” —Albert Einstein",
    "“Life isn’t finding shelter in the storm. It’s about learning to dance in the rain.” ―Sherrilyn Kenyon",
    "“It always seems impossible until it’s done.” ―Nelson Mandela",
    "give up. Laugh a lot. Be good to others.",
    "you don’t give up, you still have a chance. Giving up is the greatest failure.",
    "\"By perseverance the snail reached the ark.\" —Charles Spurgeon",
    "“It takes a dream to get started, desire to keep going, and determination to finish.” —Eddie Harris, Jr.",
    "you feel like giving up, remember why you held on for so long in the first place.",
    "life is without challenges, but it’s how we face them that counts. Choose to face yours with the mindset these quotes about not giving up demonstrate and gain the resolve you need.",
    "\"Work like there is someone working 24 hours a day to take it away from you.\" —Mark Cuban",
    "\"You are never too old to set another goal or to dream a new dream.\" —C.S. Lewis",
    "“Never give up. Today is hard, tomorrow will be worse, but the day after tomorrow will be sunshine.” – Jack Ma",
    "“Nurture your mind with great thoughts. To believe in the heroic makes heroes.\" —Benjamin Disraeli",
    "“To conquer frustration, one must remain intensely focused on the outcome, not the obstacles.”– T.F. Hodge",
    "when we find that one person who completes us, we don’t give up. No matter how bad we screw up. We make it right.",
    "\"With the right kind of coaching and determination you can accomplish anything.\" —Reese Witherspoon",
    "give up. Never give in. Never become hostile… Hate is too big a burden to bear.",
    "\"You must do the things you think you cannot do.\" —Eleanor Roosevelt",
    "you never give up, you’ll be successful.",
    "is never too late to be what you might have been.",
    "“To find something, anything, a great truth or a lost pair of glasses, you must first believe there will be some advantage in finding it.” –Jack Burden, All The King’s Men",
    "is no failure except in no longer trying.",
    "\"I can't change the direction of the wind, but I can adjust my sails to always reach my destination.\" —Jimmy Dean",
    "\"Don't give up, 'cos you have friends, don't give up, you're not beaten yet, don't give up , I know you can make it good.\" —Peter Gabriel",
    "give up on what you really want to do. The person with big dreams is more powerful than one with all the facts.",
    "Get Inspired with These 150 Goals Quotes that Will Help You Turn Your Dreams Into Reality",
    "you fall behind, run faster. Never give up, never surrender, and rise up against the odds.",
    "the best #MotivationMonday quotes to kick your week off on the right foot, click here.",
    "we find ourselves facing so much adversity, we’d do anything to escape it. That may mean giving up on ourselves, our dreams, or even our principles.",
    "\"Whether you think you can or think you can't you're right.\" —Henry Ford",
    "you don’t give up on something you truly believe in, you will find a way.",
    "up is the only sure way to fail.",
    "\"If you fall behind, run faster. Never give up, never surrender, and rise up against the odds.\" —Jesse Jackson",
    "“Never give up your desire to be what you want to be. Stay focused, persistent and relentless.” ―Debasish Mridha MD",
    "\"Nothing is impossible. The word itself says: 'I'm possible!'\" —Audrey Hepburn",
    "\"Every master was once a disaster.\" —T.S. Wood",
    "\"What you get by achieving your goals is not as important as what you become by achieving your goals.\" —Zig Ziglar",
    "probably my job to tell you life isn’t fair, but I figure you already know that. So instead, I’ll tell you that hope is precious, and you’re right not to give up.",
    "\"It is our attitude at the beginning of a difficult task which, more than anything else, will affect its successful outcome.\" —William James",
    "“Don’t give up. I believe in you all. A person’s a person. No matter how small.” —Dr. Suess",
    "\"Instead of letting your hardships and failures discourage or exhaust you, let them inspire you.\" —Michelle Obama",
    "give up on a dream just because of the time it will take to accomplish it. The time will pass anyway.",
    "\"I know from experience that you should never give up on yourself or others, no matter what.\" —George Foreman",
    "can start something. No one quits right before the prize. The middle sets people apart.",
    "never give up! While giving up when the going gets tough might sound tempting, learning how to persevere and finish strong is so much more rewarding.",
    "are planting seeds now and one day when you least expect those flowers will bloom. Trust the process.",
    "\"If you’re going through hell, keep going.\" —Winston Churchill",
    "“We can’t retract the decisions we’ve made. We can only affect the decisions we’re going to make from here.” —Nick Rice",
    "give up on your dreams, or your dreams will give up on you.",
    "defeated is often a temporary condition. Giving up is what makes it permanent.",
    "\"You're braver than you believe, stronger than you seem, and smarter than you think.\" —A. A. Milne",
    "\"The future rewards those who press on. I don't have time to feel sorry for myself. I don't have time to complain. I'm going to press on.\" —Barack Obama",
    "give up on the fight until you win the belt.",
    "allow your mind to tell your heart what to do. The mind gives up easily.",
    "give up. There are always tough times, regardless of what you do in anything in life. Be able to push through those times and maintain your ultimate goal.",
    "\"You just never give up. You do a task to the best of your abilities and beyond.\" —Debbie Reynolds",
    "\"I have not failed, I have just found 10,000 ways that won’t work.\" —Thomas Edison",
    "do not begin or, having begun, do not give up.",
    "never give up, even when people tell me that I can’t do something. But if I believe I can, I really fight for it.",
    "“God helps those who persevere.” —The Koran",
    "give up. There are too many nay-sayers out there who will try to discourage you. Don’t listen to them. The only one who can make you give up is yourself.",
    "gain nothing from giving up.",
    "at a snail’s pace is still progress, and slow progress is better than no progress. Never be stagnant, and never give up.",
    "“Everything that’s broken was beautiful at one time. And our mistakes make us better people.” —Jamie Hoang",
    "sees in you what you can’t see in yourself. Remember to keep the faith and never give up!",
    "up is conceding that things will never get better, and that is just not true.",
    "“Character consists of what you do on the third and fourth tries.” ―James A. Michener",
    "Tough times never last, but tough people do.\" —Robert. H. Schuller",
    "\"Act as if what you do makes a difference. It does.\" —William James",
    "never give up, even when you should.",
    "should not give up and we should not allow the problem to defeat us.",
    "\"No matter what you're going through, there's a light at the end of the tunnel. —Demi Lovato",
    "“I refuse to quit because I haven’t tried all possible ways yet.” —Unknown",
    "only fully releases its rewards after a person refuses to quit.",
    "lose the childlike wonder. Show gratitude. Don’t complain; just work harder… Never give up.",
    "give up trying to build the world you can see, even if others can’t see it.",
    "gave up coffee. It’s almost worse than giving up a lover.",
    "help you stay motivated so you can reach that finish line and achieve your goals—whether they're big or small—these 100 inspiring quotes about not giving up can help.",
    "\"Ambition is the path to success. Persistence is the vehicle you arrive in.\" —Bill Bradley",
    "give up hope. All things are working for your good. One day, you’ll look back on everything you’ve been through and thank God for it.",
    "“Courage doesn’t always roar, sometimes it’s the quiet voice at the end of the day whispering ‘I will try again tomorrow’.” —Mary Anne Radmacher",
    "\"When you feel like quitting think about why you started.\" —Anonymous",
    "\"If you run, you might lose. If you don’t run, you’re guaranteed to lose.\" —Jesse Jackson",
    "that spirit, here are the best never give up quotes to make you bold and resolute when you need to be.",
    "of the important things in the world have been accomplished by people who have kept on trying when there seemed to be no hope at all.",
    "hope these never give up quotes give you the resolve to stick with your task, no matter what it is.",
    "\"The struggle you’re in today is developing the strength you need for tomorrow. Don’t give up.\" —Robert Tew",
    "hard, and never give up on your dreams, even when nobody else believes they can come true but you.",
    "\"Failure happens all the time. It happens every day in practice. What makes you better is how you react to it.\" – Mia Hamm",
    "okay to doubt yourself, it’s okay to feel down; just never give up.",
    "these giving up quotes demonstrate that not giving up is more rewarding and a key part of self-belief and character.",
    "you get to the end of your rope, tie a knot and hang on.",
    "give up on things you’ve always dreamed of. Your dreams will become reality by your dedication and hard work.",
    "“Success seems to be largely a matter of hanging on after others have let go.” —William Feather",
    "give up on something that you can’t go a day without thinking about.",
    "\"Stop being afraid of what can go wrong and start being positive about what can go right.\" —Unknown",
    "“Never give up on a dream just because of the time it will take to accomplish it. The time will pass anyway.”—Earl Nightingale",
    "“When a defining moment comes along, you can do one of two things. Define the moment, or let the moment define you.” —Roy McAvoy",
    "\"Ever tried. Ever failed. No matter. Try again. Fail again. Fail better.\" —Samuel Beckett",
    "give up. You only get one life. Go for it!",
    "“Let me tell you the secret that has led to my goal. My strength lies solely on my —Louis Pasteur",
    "“How long should you try? Until.” ―Jim Rohn",
    "\"Hold fast to your dreams, for without them life is a broken winged bird that cannot fly.\" —Langston Hughes",
    "people go through hard times, so bad that they can’t even talk about it, but no matter what, we should never give up.",
    "“It does not matter how slowly you go as long as you do not stop.” ―Confucius",
    "\"Success is not final, failure is not fatal: it is the courage to continue that counts.\" —Winston Churchill",
    "\"On one hand, we know that everything happens for a reason, and there are no mistakes or coincidences. On the other hand, we learn that we can never give up, knowing that with the right tools and energy, we can reverse any decree or karma. So, which is it? Let the Light decide, or never give up? The answer is: both.\" —Yehuda Berg",
    "\"Failure is success in progress.\" —Albert Einstein",
    "“Either do not begin or, having begun, do not give up.” —Chinese Proverb",
    "“Fall seven times, stand up eight.” —Japanese Proverb",
    "of the links in this post may be affiliate links. If make a purchase through these links, we receive a commission at no extra cost to you. Please see our disclosure for more info.",
    "“Successful men and women keep moving. They make mistakes, but they don’t quit.” ―Conrad Hilton",
    "\"Survival can be summed up in three words—never give up. That’s the heart of it really. Just keep trying.\" —Bear Grylls",
    "doesn’t always roar. Sometimes it’s the quiet voice at the end of the day whispering, ‘I will try again tomorrow.’",
    "\"I think I can. I think I can. I think I can. I know I can.\" —Watty Piper, The Little Engine That Could",
    "\"It always seems impossible until it's done.\" —Nelson Mandela",
    "only thing that will stop you from fulfilling your dreams is you.",
    "\"If I cannot do great things, I can do small things in a great way.\" —Martin Luther King Jr.",
    "give up your desire to be what you want to be. Stay focused, persistent and relentless.",
    "you get tired, learn to rest, not to quit.",
    "\"Out of difficulties grow miracles.\" —Jean de la Bruyere",
    "“Part of being a champ is acting like a champ. You have to learn how to win and not run away when you lose.” – Nancy Kerrigan",
    "\"It is when we are most lost that we sometimes find our truest friends.\" —Brothers Grimm",
    "is no substitute for hard work. Never give up. Never stop believing. Never stop fighting.",
    "\"Never give up, for that is just the place and time that the tide will turn.\" —Harriet Beecher Stowe",
    "seems to be largely a matter of hanging on after others have let go.",
    "“Stick around. Don’t lose your heart, just keep going, keep at it.” —Mark Ruffalo",
    "“Be as you wish to seem.”—Socrates",
    "someone tells you that you can’t do something, perhaps you should consider that they are only telling you what they can’t do.",
    "give up. Today is hard, tomorrow will be worse, but the day after tomorrow will be sunshine.",
    "\"I am the master of my fate: I am the captain of my soul.\" —William Ernest Henley",
    "\"When you have a dream, you've got to grab it and never let go.\" —Carol Burnett",
    "\"Be where your feet are.\" —Anonymous",
    "\"No one has the power to shatter your dreams unless you give it to them.\" —Maeve Grayson",
    "you consciously decide not to give up, you’re one step closer to being stronger and turning obstacles into opportunities.",
    "aren’t always easy, but you just have to keep going and don’t let the small stuff bog you down.",
    "back involves a certain amount of giving up.",
    "“There is no failure except in no longer trying.” ―Elbert Hubbard",
    "may be the only person left who believes in you, but it’s enough. It takes just one star to pierce a universe of darkness. Never give up.",
    "in yourself and all that you are, know that there is something inside you that is greater than any obstacle.",
    "to your purpose and you will soon feel as well as you ever did. On the contrary, if you falter, and give up, you will lose the power of keeping any resolution, and will regret it all your life.",
    "can be summed up in three words — never give up.",
    "may have to fight a battle more than once to win it.",
    "always try to do my best. Sometimes is that enough to get a good result, sometimes not, but I never give up, and I never will.",
    "“Being defeated is often a temporary condition. Giving up is what makes it permanent.”—Marilyn vos Savant",
    "never, never give in.",
    "all faced times when we’ve wanted to give up. Maybe we even did!",
    "moment when you feel like giving up is right before your breakthrough.",
    "\"It is never too late to be wise.\" –Daniel Defoe",
    "\"It’s hard to beat a person who never gives up.\" —Babe Ruth",
    "men and women keep moving. They make mistakes, but they don’t quit.",
    "\"I will love the light for it shows me the way, yet I will endure the darkness because it shows me the stars.\" —Og Mandino",
    "\"You are never too old to set another goal or to dream a new dream.\" —Audrey Hepburn",
    "it a quest to never give up even when the dots seem as if they are difficult to connect.",
    "reason I never give up hope is because everything is so basically hopeless.",
    "“You do what you can for as long as you can, and when you finally can’t, you do the next best thing. You back up but you don’t give up.” ―Chuck Yeager",
    "out into the world with your passion and love for what you do, and just never give up.",
    "give in or give up, but do grow up!",
    "give up, and be confident in what you do. There may be tough times, but the difficulties which you face will make you more determined to achieve your objectives and to win against all the odds.",
    "you are going through hell, keep going.",
    "only thing you should ever quit is giving up!",
    "\"Believe you can and you're halfway there.\" —Theodore Roosevelt",
    "not that I’m so smart, it’s just that I stay with problems longer.",
    "winner is just a loser who tried one more time.",
    "just never liked giving up on anything.",
    "could be worse than the fear that one had given up too soon, and left one unexpended effort that might have saved the world.",
    "up trying to make me give up.",
    "\"Giving up is for rookies.\" —Philoctetes",
    "stop trying. Never stop believing. Never give up. Your day will come.",
    "do what you can for as long as you can, and when you finally can’t, you do the next best thing. You back up but you don’t give up.",
    "\"Just don't give up trying to do what you really want to do. Where there is love and inspiration, I don't think you can go wrong.\" —Ella Fitzgerald",
    "me, the hardest thing for a man to give up is that which he really doesn’t want, after all.",
    "Every Day We Hustlin'—155 Inspiring Hustle Quotes That'll Help You Stay Motivated",
    "greatest weakness lies in giving up. The most certain way to succeed is always to try just one more time.",
    "was taught the way of progress is neither swift nor easy.",
    "strengths does not come from winning. Your struggles develop your strengths. When you go through hardships and decide not to surrender, that is true strength."
  ],
  "lastFatched": "10:28PM on September 08, 2022",
  "count": 212
}